hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_spi_regs.h
/*
 * LSB (RW)
 *
 * Transfer data with the least significant bit first
 * 0x0: Most significant bit first
 * 0x1: Least significant bit first
 */
#define SPI_TRANSFMT_LSB_MASK (0x8U)
#define SPI_TRANSFMT_LSB_SHIFT (3U)
#define SPI_TRANSFMT_LSB_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_LSB_SHIFT) & SPI_TRANSFMT_LSB_MASK)
#define SPI_TRANSFMT_LSB_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_LSB_MASK) >> SPI_TRANSFMT_LSB_SHIFT)

/*
 * SLVMODE (RW)
 *
 * SPI Master/Slave mode selection
 * 0x0: Master mode
 * 0x1: Slave mode
 */
#define SPI_TRANSFMT_SLVMODE_MASK (0x4U)
#define SPI_TRANSFMT_SLVMODE_SHIFT (2U)
#define SPI_TRANSFMT_SLVMODE_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_SLVMODE_SHIFT) & SPI_TRANSFMT_SLVMODE_MASK)
#define SPI_TRANSFMT_SLVMODE_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_SLVMODE_MASK) >> SPI_TRANSFMT_SLVMODE_SHIFT)

/*
 * CPOL (RW)
 *
 * SPI Clock Polarity
 * 0x0: SCLK is LOW in the idle states
 * 0x1: SCLK is HIGH in the idle states
 */
#define SPI_TRANSFMT_CPOL_MASK (0x2U)
#define SPI_TRANSFMT_CPOL_SHIFT (1U)
#define SPI_TRANSFMT_CPOL_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_CPOL_SHIFT) & SPI_TRANSFMT_CPOL_MASK)
#define SPI_TRANSFMT_CPOL_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_CPOL_MASK) >> SPI_TRANSFMT_CPOL_SHIFT)

/*
 * CPHA (RW)
 *
 * SPI Clock Phase
 * 0x0: Sampling data at odd SCLK edges
 * 0x1: Sampling data at even SCLK edges
 */
#define SPI_TRANSFMT_CPHA_MASK (0x1U)
#define SPI_TRANSFMT_CPHA_SHIFT (0U)
#define SPI_TRANSFMT_CPHA_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_CPHA_SHIFT) & SPI_TRANSFMT_CPHA_MASK)
#define SPI_TRANSFMT_CPHA_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_CPHA_MASK) >> SPI_TRANSFMT_CPHA_SHIFT)

/* Bitfield definition for register: DIRECTIO */
/*
 * DIRECTIOEN (RW)
 *
 * Enable Direct IO
 * 0x0: Disable
 * 0x1: Enable
 */
#define SPI_DIRECTIO_DIRECTIOEN_MASK (0x1000000UL)
#define SPI_DIRECTIO_DIRECTIOEN_SHIFT (24U)
#define SPI_DIRECTIO_DIRECTIOEN_SET(x) (((uint32_t)(x) << SPI_DIRECTIO_DIRECTIOEN_SHIFT) & SPI_DIRECTIO_DIRECTIOEN_MASK)
#define SPI_DIRECTIO_DIRECTIOEN_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_DIRECTIOEN_MASK) >> SPI_DIRECTIO_DIRECTIOEN_SHIFT)

/*
 * HOLD_OE (RW)
 *
 * Output enable for the SPI Flash hold signal
 */
#define SPI_DIRECTIO_HOLD_OE_MASK (0x200000UL)
#define SPI_DIRECTIO_HOLD_OE_SHIFT (21U)
#define SPI_DIRECTIO_HOLD_OE_SET(x) (((uint32_t)(x) << SPI_DIRECTIO_HOLD_OE_SHIFT) & SPI_DIRECTIO_HOLD_OE_MASK)
#define SPI_DIRECTIO_HOLD_OE_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_HOLD_OE_MASK) >> SPI_DIRECTIO_HOLD_OE_SHIFT)

/*
 * WP_OE (RW)
 *
 * Output enable for the SPI Flash write protect signal
 */
#define SPI_DIRECTIO_WP_OE_MASK (0x100000UL)
#define SPI_DIRECTIO_WP_OE_SHIFT (20U)
#define SPI_DIRECTIO_WP_OE_SET(x) (((uint32_t)(x) << SPI_DIRECTIO_WP_OE_SHIFT) & SPI_DIRECTIO_WP_OE_MASK)
#define SPI_DIRECTIO_WP_OE_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_WP_OE_MASK) >> SPI_DIRECTIO_WP_OE_SHIFT)

/*
 * MISO_OE (RW)
 *
 * Output enable fo the SPI MISO signal
 */
#define SPI_DIRECTIO_MISO_OE_MASK (0x80000UL)
#define SPI_DIRECTIO_MISO_OE_SHIFT (19U)
#define SPI_DIRECTIO_MISO_OE_SET(x) (((uint32_t)(x) << SPI_DIRECTIO_MISO_OE_SHIFT) & SPI_DIRECTIO_MISO_OE_MASK)
#define SPI_DIRECTIO_MISO_OE_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_MISO_OE_MASK) >> SPI_DIRECTIO_MISO_OE_SHIFT)

/*
 * MOSI_OE (RW)
 *
 * Output enable for the SPI MOSI signal
 */
#define SPI_DIRECTIO_MOSI_OE_MASK (0x40000UL)
#define SPI_DIRECTIO_MOSI_OE_SHIFT (18U)
#define SPI_DIRECTIO_MOSI_OE_SET(x) (((uint32_t)(x) << SPI_DIRECTIO_MOSI_OE_SHIFT) & SPI_DIRECTIO_MOSI_OE_MASK)
#define SPI_DIRECTIO_MOSI_OE_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_MOSI_OE_MASK) >> SPI_DIRECTIO_MOSI_OE_SHIFT)

/*
 * SCLK_OE (RW)
 *
 * Output enable for the SPI SCLK signal
 */
#define SPI_DIRECTIO_SCLK_OE_MASK (0x20000UL)
#define SPI_DIRECTIO_SCLK_OE_SHIFT (17U)
#define SPI_DIRECTIO_SCLK_OE_SET(x) (((uint32_t)(x) << SPI_DIRECTIO_SCLK_OE_SHIFT) & SPI_DIRECTIO_SCLK_OE_MASK)
#define SPI_DIRECTIO_SCLK_OE_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_SCLK_OE_MASK) >> SPI_DIRECTIO_SCLK_OE_SHIFT)

/*
 * CS_OE (RW)
 *
 * Output enable for SPI CS (chip select) signal
 */
#define SPI_DIRECTIO_CS_OE_MASK (0x10000UL)
#define SPI_DIRECTIO_CS_OE_SHIFT (16U)
#define SPI_DIRECTIO_CS_OE_SET(x) (((uint32_t)(x) << SPI_DIRECTIO_CS_OE_SHIFT) & SPI_DIRECTIO_CS_OE_MASK)
#define SPI_DIRECTIO_CS_OE_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_CS_OE_MASK) >> SPI_DIRECTIO_CS_OE_SHIFT)

/*
 * HOLD_O (RW)
 *
 * Output value for the SPI Flash hold signal
 */
#define SPI_DIRECTIO_HOLD_O_MASK (0x2000U)
#define SPI_DIRECTIO_HOLD_O_SHIFT (13U)
#define SPI_DIRECTIO_HOLD_O_SET(x) (((uint32_t)(x) << SPI_DIRECTIO_HOLD_O_SHIFT) & SPI_DIRECTIO_HOLD_O_MASK)
#define SPI_DIRECTIO_HOLD_O_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_HOLD_O_MASK) >> SPI_DIRECTIO_HOLD_O_SHIFT)

/*
 * WP_O (RW)
 *
 * Output value for the SPI Flash write protect signal
 */
#define SPI_DIRECTIO_WP_O_MASK (0x1000U)
#define SPI_DIRECTIO_WP_O_SHIFT (12U)
#define SPI_DIRECTIO_WP_O_SET(x) (((uint32_t)(x) << SPI_DIRECTIO_WP_O_SHIFT) & SPI_DIRECTIO_WP_O_MASK)
#define SPI_DIRECTIO_WP_O_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_WP_O_MASK) >> SPI_DIRECTIO_WP_O_SHIFT)

/*
 * MISO_O (RW)
 *
 * Output value for the SPI MISO signal
 */
#define SPI_DIRECTIO_MISO_O_MASK (0x800U)
#define SPI_DIRECTIO_MISO_O_SHIFT (11U)
#define SPI_DIRECTIO_MISO_O_SET(x) (((uint32_t)(x) << SPI_DIRECTIO_MISO_O_SHIFT) & SPI_DIRECTIO_MISO_O_MASK)
#define SPI_DIRECTIO_MISO_O_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_MISO_O_MASK) >> SPI_DIRECTIO_MISO_O_SHIFT)

/*
 * MOSI_O (RW)
 *
 * Output value for the SPI MOSI signal
 */
#define SPI_DIRECTIO_MOSI_O_MASK (0x400U)
#define SPI_DIRECTIO_MOSI_O_SHIFT (10U)
#define SPI_DIRECTIO_MOSI_O_SET(x) (((uint32_t)(x) << SPI_DIRECTIO_MOSI_O_SHIFT) & SPI_DIRECTIO_MOSI_O_MASK)
#define SPI_DIRECTIO_MOSI_O_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_MOSI_O_MASK) >> SPI_DIRECTIO_MOSI_O_SHIFT)

/*
 * SCLK_O (RW)
 *
 * Output value for the SPI SCLK signal
 */
#define SPI_DIRECTIO_SCLK_O_MASK (0x200U)
#define SPI_DIRECTIO_SCLK_O_SHIFT (9U)
#define SPI_DIRECTIO_SCLK_O_SET(x) (((uint32_t)(x) << SPI_DIRECTIO_SCLK_O_SHIFT) & SPI_DIRECTIO_SCLK_O_MASK)
#define SPI_DIRECTIO_SCLK_O_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_SCLK_O_MASK) >> SPI_DIRECTIO_SCLK_O_SHIFT)

