hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_spi_regs.h
/*
 * RXFIFOINTEN (RW)
 *
 * Enable the SPI Receive FIFO Threshold interrupt.
 * Control whether interrupts are triggered when the valid entries are greater than or equal to the RX FIFO threshold.
 */
#define SPI_INTREN_RXFIFOINTEN_MASK (0x4U)
#define SPI_INTREN_RXFIFOINTEN_SHIFT (2U)
#define SPI_INTREN_RXFIFOINTEN_SET(x) (((uint32_t)(x) << SPI_INTREN_RXFIFOINTEN_SHIFT) & SPI_INTREN_RXFIFOINTEN_MASK)
#define SPI_INTREN_RXFIFOINTEN_GET(x) (((uint32_t)(x) & SPI_INTREN_RXFIFOINTEN_MASK) >> SPI_INTREN_RXFIFOINTEN_SHIFT)

/*
 * TXFIFOURINTEN (RW)
 *
 * Enable the SPI Transmit FIFO Underrun interrupt.
 * Control whether interrupts are triggered when the Transmit FIFO run out of data.
 * (Slave mode only)
 */
#define SPI_INTREN_TXFIFOURINTEN_MASK (0x2U)
#define SPI_INTREN_TXFIFOURINTEN_SHIFT (1U)
#define SPI_INTREN_TXFIFOURINTEN_SET(x) (((uint32_t)(x) << SPI_INTREN_TXFIFOURINTEN_SHIFT) & SPI_INTREN_TXFIFOURINTEN_MASK)
#define SPI_INTREN_TXFIFOURINTEN_GET(x) (((uint32_t)(x) & SPI_INTREN_TXFIFOURINTEN_MASK) >> SPI_INTREN_TXFIFOURINTEN_SHIFT)

/*
 * RXFIFOORINTEN (RW)
 *
 * Enable the SPI Receive FIFO Overrun interrupt.
 * Control whether interrupts are triggered when the Receive FIFO overflows.
 * (Slave mode only)
 */
#define SPI_INTREN_RXFIFOORINTEN_MASK (0x1U)
#define SPI_INTREN_RXFIFOORINTEN_SHIFT (0U)
#define SPI_INTREN_RXFIFOORINTEN_SET(x) (((uint32_t)(x) << SPI_INTREN_RXFIFOORINTEN_SHIFT) & SPI_INTREN_RXFIFOORINTEN_MASK)
#define SPI_INTREN_RXFIFOORINTEN_GET(x) (((uint32_t)(x) & SPI_INTREN_RXFIFOORINTEN_MASK) >> SPI_INTREN_RXFIFOORINTEN_SHIFT)

/* Bitfield definition for register: INTRST */
/*
 * SLVCMDINT (W1C)
 *
 * Slave Command Interrupt.
 * This bit is set when Slave Command interrupts occur.
 * (Slave mode only)
 */
#define SPI_INTRST_SLVCMDINT_MASK (0x20U)
#define SPI_INTRST_SLVCMDINT_SHIFT (5U)
#define SPI_INTRST_SLVCMDINT_SET(x) (((uint32_t)(x) << SPI_INTRST_SLVCMDINT_SHIFT) & SPI_INTRST_SLVCMDINT_MASK)
#define SPI_INTRST_SLVCMDINT_GET(x) (((uint32_t)(x) & SPI_INTRST_SLVCMDINT_MASK) >> SPI_INTRST_SLVCMDINT_SHIFT)

/*
 * ENDINT (W1C)
 *
 * End of SPI Transfer interrupt.
 * This bit is set when End of SPI Transfer interrupts occur.
 */
#define SPI_INTRST_ENDINT_MASK (0x10U)
#define SPI_INTRST_ENDINT_SHIFT (4U)
#define SPI_INTRST_ENDINT_SET(x) (((uint32_t)(x) << SPI_INTRST_ENDINT_SHIFT) & SPI_INTRST_ENDINT_MASK)
#define SPI_INTRST_ENDINT_GET(x) (((uint32_t)(x) & SPI_INTRST_ENDINT_MASK) >> SPI_INTRST_ENDINT_SHIFT)

/*
 * TXFIFOINT (W1C)
 *
 * TX FIFO Threshold interrupt.
 * This bit is set when TX FIFO Threshold interrupts occur.
 */
#define SPI_INTRST_TXFIFOINT_MASK (0x8U)
#define SPI_INTRST_TXFIFOINT_SHIFT (3U)
#define SPI_INTRST_TXFIFOINT_SET(x) (((uint32_t)(x) << SPI_INTRST_TXFIFOINT_SHIFT) & SPI_INTRST_TXFIFOINT_MASK)
#define SPI_INTRST_TXFIFOINT_GET(x) (((uint32_t)(x) & SPI_INTRST_TXFIFOINT_MASK) >> SPI_INTRST_TXFIFOINT_SHIFT)

/*
 * RXFIFOINT (W1C)
 *
 * RX FIFO Threshold interrupt.
 * This bit is set when RX FIFO Threshold interrupts occur.
 */
#define SPI_INTRST_RXFIFOINT_MASK (0x4U)
#define SPI_INTRST_RXFIFOINT_SHIFT (2U)
#define SPI_INTRST_RXFIFOINT_SET(x) (((uint32_t)(x) << SPI_INTRST_RXFIFOINT_SHIFT) & SPI_INTRST_RXFIFOINT_MASK)
#define SPI_INTRST_RXFIFOINT_GET(x) (((uint32_t)(x) & SPI_INTRST_RXFIFOINT_MASK) >> SPI_INTRST_RXFIFOINT_SHIFT)

/*
 * TXFIFOURINT (W1C)
 *
 * TX FIFO Underrun interrupt.
 * This bit is set when TX FIFO Underrun interrupts occur.
 * (Slave mode only)
 */
#define SPI_INTRST_TXFIFOURINT_MASK (0x2U)
#define SPI_INTRST_TXFIFOURINT_SHIFT (1U)
#define SPI_INTRST_TXFIFOURINT_SET(x) (((uint32_t)(x) << SPI_INTRST_TXFIFOURINT_SHIFT) & SPI_INTRST_TXFIFOURINT_MASK)
#define SPI_INTRST_TXFIFOURINT_GET(x) (((uint32_t)(x) & SPI_INTRST_TXFIFOURINT_MASK) >> SPI_INTRST_TXFIFOURINT_SHIFT)

/*
 * RXFIFOORINT (W1C)
 *
 * RX FIFO Overrun interrupt.
 * This bit is set when RX FIFO Overrun interrupts occur.
 * (Slave mode only)
 */
#define SPI_INTRST_RXFIFOORINT_MASK (0x1U)
#define SPI_INTRST_RXFIFOORINT_SHIFT (0U)
#define SPI_INTRST_RXFIFOORINT_SET(x) (((uint32_t)(x) << SPI_INTRST_RXFIFOORINT_SHIFT) & SPI_INTRST_RXFIFOORINT_MASK)
#define SPI_INTRST_RXFIFOORINT_GET(x) (((uint32_t)(x) & SPI_INTRST_RXFIFOORINT_MASK) >> SPI_INTRST_RXFIFOORINT_SHIFT)

/* Bitfield definition for register: TIMING */
/*
 * CS2SCLK (RW)
 *
 * The minimum time between the edges of SPI CS and the edges of SCLK.
 * SCLK_period * (CS2SCLK + 1) / 2
 */
#define SPI_TIMING_CS2SCLK_MASK (0x3000U)
#define SPI_TIMING_CS2SCLK_SHIFT (12U)
#define SPI_TIMING_CS2SCLK_SET(x) (((uint32_t)(x) << SPI_TIMING_CS2SCLK_SHIFT) & SPI_TIMING_CS2SCLK_MASK)
#define SPI_TIMING_CS2SCLK_GET(x) (((uint32_t)(x) & SPI_TIMING_CS2SCLK_MASK) >> SPI_TIMING_CS2SCLK_SHIFT)

/*
 * CSHT (RW)
 *
 * The minimum time that SPI CS should stay HIGH.
 * SCLK_period * (CSHT + 1) / 2
 */
#define SPI_TIMING_CSHT_MASK (0xF00U)
#define SPI_TIMING_CSHT_SHIFT (8U)
#define SPI_TIMING_CSHT_SET(x) (((uint32_t)(x) << SPI_TIMING_CSHT_SHIFT) & SPI_TIMING_CSHT_MASK)
#define SPI_TIMING_CSHT_GET(x) (((uint32_t)(x) & SPI_TIMING_CSHT_MASK) >> SPI_TIMING_CSHT_SHIFT)

/*
 * SCLK_DIV (RW)
 *
 * The clock frequency ratio between the clock source and SPI interface SCLK.
 * SCLK_period = ((SCLK_DIV + 1) * 2) * (Period of the SPI clock source)
 * The SCLK_DIV value 0xff is a special value which indicates that the SCLK frequency should be the same as the spi_clock frequency.
 */
#define SPI_TIMING_SCLK_DIV_MASK (0xFFU)
#define SPI_TIMING_SCLK_DIV_SHIFT (0U)
#define SPI_TIMING_SCLK_DIV_SET(x) (((uint32_t)(x) << SPI_TIMING_SCLK_DIV_SHIFT) & SPI_TIMING_SCLK_DIV_MASK)
#define SPI_TIMING_SCLK_DIV_GET(x) (((uint32_t)(x) & SPI_TIMING_SCLK_DIV_MASK) >> SPI_TIMING_SCLK_DIV_SHIFT)

/* Bitfield definition for register: SLVST */
/*
 * UNDERRUN (W1C)
 *
 * Data underrun occurs in the last transaction
 */
#define SPI_SLVST_UNDERRUN_MASK (0x40000UL)
#define SPI_SLVST_UNDERRUN_SHIFT (18U)
#define SPI_SLVST_UNDERRUN_SET(x) (((uint32_t)(x) << SPI_SLVST_UNDERRUN_SHIFT) & SPI_SLVST_UNDERRUN_MASK)
#define SPI_SLVST_UNDERRUN_GET(x) (((uint32_t)(x) & SPI_SLVST_UNDERRUN_MASK) >> SPI_SLVST_UNDERRUN_SHIFT)

